In [162]:
import numpy as np
import os
import pandas as pd
import env
from pydataset import data

In [163]:
os.path.exists('env.py')

True

### Excercise Set 1

1. Create a function named `get_db_url`. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [164]:
def get_db_url(db, env_file=os.path.exists('env.py')):
    '''
    Accepts the string of which schema you want to connect to, grabs user, password, and host
    from your env.py file.
    This function is so you aren't posting your login credientials.
    Please make sure your env file is ALWAYS in your gitignore.
    '''
    if env_file:
        user, password, host = (env.user, env.password, env.host)
        return f'mysql+pymysql://{user}:{password}@{host}/{db}'
    else:
        return 'Please ensure you have proper credentials in your env.py, and check the spelling of the database.'

2. Use your function to obtain a connection to the `employees` database.

3. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?
    
    b. Intentionally make an error in your SQL query. What does the error message look like?

In [165]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees
"""

employees = pd.read_sql(sql, url)
employees.shape

(300024, 6)

4. Read the `employees` and `titles` tables into two separate DataFrames.

In [166]:
# THESE NEXT ONES ARE COMMENTED OUT BECAUSE I DON'T WANT TO SAVE A LOCAL COPY EVERY TIME.

#df_employees = pd.read_sql('SELECT * FROM employees', url)
#df_titles = pd.read_sql('SELECT * FROM titles', url)

In [167]:
# Creates a local copy in .csv (comma separated valuesheet) form.
#df_employees.to_csv('employees.csv')
#df_titles.to_csv('titles.csv')

In [168]:
df_employees = pd.read_csv('employees.csv')
df_titles = pd.read_csv('titles.csv')
print(df_employees.shape)
print(df_titles.shape)

(300024, 7)
(443308, 5)

5. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [169]:
print(df_employees.info())
print(df_titles.info())
# 7 columns and over 300,000 rows for employees, and 5 columns and over 400,000 rows. 
# The numbers are about what I expected excpet the 100,000 gap, 
# but then I remembered it has records of previous titles an employee has.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 7 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  300024 non-null  int64
 1   emp_no      300024 non-null  int64
 2   birth_date  300024 non-null  object
 3   first_name  300024 non-null  object
 4   last_name   300024 non-null  object
 5   gender      300024 non-null  object
 6   hire_date   300024 non-null  object
dtypes: int64(2), object(5)
memory usage: 16.0+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  443308 non-null  int64
 1   emp_no      443308 non-null  int64
 2   title       443308 non-null  object
 3   from_date   443308 non-null  object
 4   to_date     443308 non-null  object
dtypes: int64(2), object(3)
memory usage: 16.9+ MB
None

6. Display the summary statistics for each DataFrame.

In [170]:
print(df_employees.describe(include = 'all'))
print(df_titles.describe(include = 'all'))

           Unnamed: 0         emp_no  birth_date first_name last_name  gender  \
count   300024.000000  300024.000000      300024     300024    300024  300024
unique            NaN            NaN        4750       1275      1637       2
top               NaN            NaN  1952-03-08     Shahab      Baba       M
freq              NaN            NaN          95        295       226  179973
mean    150011.500000  253321.763392         NaN        NaN       NaN     NaN
std      86609.612919  161828.235540         NaN        NaN       NaN     NaN
min          0.000000   10001.000000         NaN        NaN       NaN     NaN
25%      75005.750000   85006.750000         NaN        NaN       NaN     NaN
50%     150011.500000  249987.500000         NaN        NaN       NaN     NaN
75%     225017.250000  424993.250000         NaN        NaN       NaN     NaN
max     300023.000000  499999.000000         NaN        NaN       NaN     NaN

         hire_date
count       300024
unique        5434
top     1985-06-20
freq           132
mean           NaN
std            NaN
min            NaN
25%            NaN
50%            NaN
75%            NaN
max            NaN
           Unnamed: 0         emp_no     title   from_date     to_date
count   443308.000000  443308.000000    443308      443308      443308
unique            NaN            NaN         7        6393        5888
top               NaN            NaN  Engineer  1998-10-25  9999-01-01
freq              NaN            NaN    115003         132      240124
mean    221653.500000  253075.034430       NaN         NaN         NaN
std     127972.140904  161853.292613       NaN         NaN         NaN
min          0.000000   10001.000000       NaN         NaN         NaN
25%     110826.750000   84855.750000       NaN         NaN         NaN
50%     221653.500000  249847.500000       NaN         NaN         NaN
75%     332480.250000  424891.250000       NaN         NaN         NaN
max     443307.000000  499999.000000       NaN         NaN         NaN


7. How many unique titles are in the `titles` DataFrame?

In [171]:
len(df_titles['title'].unique())

7


8. What is the oldest date in the `to_date` column?

In [172]:
df_titles['to_date'].min()

'1985-03-01'


9. What is the most recent date in the `to_date` column?

In [173]:
df_titles['to_date'].max()
# I'd love to do < NOW() but that SQL doesn't work with the csv that I could figure out.

'9999-01-01'

### Exercise Set 2

Copy the users and roles DataFrames from the examples above.

In [174]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

What is the result of using a right join on the DataFrames?

In [175]:
pd.merge?

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'str' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool' = True,
    indicator: 'bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
left : DataFrame
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      /usr/local/anaconda3/lib/python3.9/site-packages/pandas/core/reshape/merge.py
Type:      function

In [176]:
users.merge(roles, how="right")

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [177]:
roles.merge(users, how="right")

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [178]:
roles.merge(users, how="right", right_on="id", left_on="id")

   id     name_x name_y  role_id
0   1      admin    bob      1.0
1   2     author    joe      2.0
2   3   reviewer  sally      3.0
3   4  commenter   adam      3.0
4   5        NaN   jane      NaN
5   6        NaN   mike      NaN

What is the result of using an outer join on the DataFrames?

In [179]:
roles.merge(users, how="outer")

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN
4   1        bob      1.0
5   2        joe      2.0
6   3      sally      3.0
7   4       adam      3.0
8   5       jane      NaN
9   6       mike      NaN

In [180]:
roles.merge(users, how="outer", right_on="id", left_on="id")

   id     name_x name_y  role_id
0   1      admin    bob      1.0
1   2     author    joe      2.0
2   3   reviewer  sally      3.0
3   4  commenter   adam      3.0
4   5        NaN   jane      NaN
5   6        NaN   mike      NaN

In [181]:
# clean up chaining?!
clean_merge = roles.merge(users,
                         how="outer", 
                         right_on="id", 
                         left_on="id").drop(columns='role_id').rename(columns={'name_x' : 'role',
                                                                                 'name_y' : 'name'}
                                                                                 ) 
clean_merge

   id       role   name
0   1      admin    bob
1   2     author    joe
2   3   reviewer  sally
3   4  commenter   adam
4   5        NaN   jane
5   6        NaN   mike

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [182]:
# Foreign keys are how you can merge tables together, doing this would make it impossible to merge.

Load the mpg dataset from PyDataset.

In [183]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

Output and read the documentation for the mpg dataset.

In [184]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

How many rows and columns are in the dataset?

In [185]:
# 234 rows with 11 columns
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

Check out your column names and perform any cleanup you may want on them.

In [186]:
mpg = mpg.rename(columns={'class' : 'car_type'})
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_type
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

Display the summary statistics for the dataset.

In [187]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

How many different manufacturers are there?

In [188]:
len(mpg.manufacturer.unique())

15

How many different models are there?

In [189]:
len(mpg.model.unique())

38

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [190]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_type,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [191]:
mpg['average_mileage'] = (mpg.hwy + mpg.cty) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_type,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [192]:
mpg.trans.unique()

array(['auto(l5)', 'manual(m5)', 'manual(m6)', 'auto(av)', 'auto(s6)',
       'auto(l4)', 'auto(l3)', 'auto(l6)', 'auto(s5)', 'auto(s4)'],
      dtype=object)

In [193]:
mpg['is_automatic'] = (mpg.trans != "manual(m5)") & (mpg.trans != "manual(m6)")
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,car_type,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [194]:
mpg.manufacturer[mpg.average_mileage == mpg.average_mileage.max()]

222    volkswagen
Name: manufacturer, dtype: object

Do automatic or manual cars have better miles per gallon?

In [195]:
print(f"Average of Automatic Averages is {np.average(mpg.average_mileage[mpg.is_automatic == True])}")
print(f"Average of Manual Averages is {np.average(mpg.average_mileage[mpg.is_automatic == False])}")
print('Manuals have better MPG')

Average of Automatic Averages is 19.130573248407643
Average of Manual Averages is 22.227272727272727
Manuals have better MPG

### Exercises Set 3

Use your get_db_url function to help you explore the data from the chipotle database.

In [196]:
url = get_db_url("chipotle")

In [197]:
sql = """
SELECT * FROM orders
"""
orders = pd.read_sql(sql, url)
orders.shape

(4622, 6)

In [198]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

What is the total price for each order?

In [200]:
orders['item_price'] = orders.item_price.str.replace("$", "").astype(float)
# orders.info()
order_totals = orders.groupby('order_id').item_price.sum()
orders.head()
order_totals.head(20)

/var/folders/q3/1b2t5ssx44b5gc0gsnqnd4ww0000gn/T/ipykernel_8289/1592504909.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace("$", "").astype(float)

order_id
1     11.56
2     16.98
3     12.67
4     21.00
5     13.70
6     17.50
7     15.70
8     10.88
9     10.67
10    13.20
11    12.38
12    14.37
13    10.88
14    10.08
15    10.88
16    10.68
17    10.08
18    24.90
19    13.90
20    36.20
Name: item_price, dtype: float64

What are the most popular 3 items?

In [205]:
most_pop = orders.groupby('item_name').quantity.sum().sort_values(ascending=False).head(3)
most_pop
# Be careful, if you misassign you'll end up with a huge problem, I was trying to figure 
# this out and added up items then quant, and reassigned them as the group, had to rerun 
# everything to clear that mistake and properly solve it.

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

Which item has produced the most revenue?

In [211]:
most_revenue = orders.groupby('item_name').item_price.sum().nlargest(1)
print(most_revenue)
least_revenue = orders.groupby('item_name').item_price.sum().nsmallest(1)
print(least_revenue)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64
item_name
Chips and Mild Fresh Tomato Salsa    3.0
Name: item_price, dtype: float64

Join the employees and titles DataFrames together.

In [214]:
joined_df_titles_emp =  df_employees.merge(df_titles, on="emp_no")
joined_df_titles_emp.head()

,Unnamed: 0_x,emp_no,birth_date,first_name,last_name,gender,hire_date,Unnamed: 0_y,title,from_date,to_date
0,0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,0,Senior Engineer,1986-06-26,9999-01-01
1,1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,1,Staff,1996-08-03,9999-01-01
2,2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,2,Senior Engineer,1995-12-03,9999-01-01
3,3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,3,Engineer,1986-12-01,1995-12-01
4,3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,4,Senior Engineer,1995-12-01,9999-01-01

For each title, find the hire date of the employee that was hired most recently with that title.

In [215]:
joined_df_titles_emp.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [219]:
url = get_db_url('employees')
sql = '''
                    SELECT t.emp_no, 
                    t.title, 
                    t.from_date, 
                    t.to_date, 
                    d.dept_name 
                    FROM departments AS d 
                    JOIN dept_emp AS de USING(dept_no) 
                    JOIN titles AS t USING(emp_no);
                    '''
dept_titles = pd.read_sql(sql,url)

In [228]:
pd.crosstab(dept_titles.dept_name, dept_titles.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0